# IsUserAssignableParameterGroup Method (BuiltInParameterGroup) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..IsUserAssignableParameterGroup Method (BuiltInParameterGroup)
FamilyManager Class See Also
---
Checks if the given parameter group can be assigned to new parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
[ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `IsUserAssignableParameterGroup(ForgeTypeId)` method instead.")]
public bool IsUserAssignableParameterGroup(
	BuiltInParameterGroup parameterGroup
)
```

Visual Basic
---
```text
<ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `IsUserAssignableParameterGroup(ForgeTypeId)` method instead.")> _
Public Function IsUserAssignableParameterGroup ( _
	parameterGroup As BuiltInParameterGroup _
) As Boolean
```

Visual C++
---
```text
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `IsUserAssignableParameterGroup(ForgeTypeId)` method instead.")]
public:
bool IsUserAssignableParameterGroup(
	BuiltInParameterGroup parameterGroup
)
```

# ### Parameters
parameterGroup
    Type: Autodesk.Revit.DB..::..BuiltInParameterGroup
# ### Return Value
True if the parameter group can be assigned to new parameters, false otherwise.
# See Also
FamilyManager Class
IsUserAssignableParameterGroup Overload
Autodesk.Revit.DB Namespace